In [1]:
import numpy as np
import pandas as pd

In [2]:
!pip uninstall tabula

^C

In [ ]:
!pip install openpyxl --user
!pip install lxml --user
!pip uinstall tabula-py --user

EXERCISE 1: READ DATA FROM A CSV

In [5]:
df1 = pd.read_csv("CSV_EX_1.csv")

In [6]:
df1

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [5]:
df1.describe
df2 = pd.read_csv("CSV_EX_2.csv", header=None, names=['Bedroom', 'Sq. foot','Locality','Price ($)'])

In [6]:
df2

   Bedroom  Sq. foot    Locality  Price ($)
0        2      1500        Good     300000
1        3      1300        Fair     240000
2        3      1900   Very good     450000
3        3      1850         Bad     280000
4        2      1640        Good     310000

EXERCISE 3: Read data from a CSV where delimiters/seperators are not comma

In [7]:
df3 = pd.read_csv("csv_ex_3.csv")

In [8]:
df3.describe()

       Bedroom; Sq. foot; Locality; Price ($)
count                                       5
unique                                      5
top                     3; 1300; Fair; 240000
freq                                        1

In [9]:
df3 = pd.read_csv("csv_ex_3.csv", sep=';')

In [10]:
df3.describe(include=['O'])

        Locality
count          5
unique         4
top         Good
freq           2

EXERCISE 4: How to bypass given headers with your own

In [8]:
df4 = pd.read_csv("csv_ex_1.csv", names=['A','B','C','D'])

In [9]:
df4

         A          B           C           D
0  Bedroom   Sq. foot    Locality   Price ($)
1        2       1500        Good      300000
2        3       1300        Fair      240000
3        3       1900   Very good      450000
4        3       1850         Bad      280000
5        2       1640        Good      310000

In [13]:
df4 = pd.read_csv("csv_ex_1.csv", header=0, names=['A','B','C','D'])

In [14]:
df4

   A     B           C       D
0  2  1500        Good  300000
1  3  1300        Fair  240000
2  3  1900   Very good  450000
3  3  1850         Bad  280000
4  2  1640        Good  310000

In [15]:
df5 = pd.read_csv("csv_ex_skiprows.csv", skiprows=2)

In [16]:
df5

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

EXERCISE 6: Skip footers

In [17]:
df6 = pd.read_csv("csv_ex_skipfooter.csv")

In [18]:
df6

  Filetype: CSV                Unnamed: 1  Unnamed: 2  Unnamed: 3
0           NaN    Info about some houses         NaN         NaN
1       Bedroom                  Sq. foot    Locality   Price ($)
2             2                      1500        Good      300000
3             3                      1300        Fair      240000
4             3                      1900   Very good      450000
5             3                      1850         Bad      280000
6             2                      1640        Good      310000
7           NaN   This is the end of file         NaN         NaN

In [19]:
df6 = pd.read_csv("csv_ex_skipfooter.csv", skipfooter=1, skiprows=2, engine='python')

In [20]:
df6

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

EXERCISE 7: Read only first n rows (especially useful for large files)

In [21]:
df7 = pd.read_csv("csv_ex_1.csv", nrows=3)

In [22]:
df7

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000

In [23]:
list_of_dataframe = []
rows_in_a_chunk = 10
num_chunks = 5
df_dummy = pd.read_csv("Boston_housing.csv", nrows=2)
colnames = df_dummy.columns
for i in range(0, num_chunks*rows_in_a_chunk, rows_in_a_chunk):
    df = pd.read_csv("Boston_housing.csv", header=0, skiprows=i, nrows=rows_in_a_chunk, names=colnames)
    list_of_dataframe.append(df)

In [24]:
df8 = pd.read_csv("Boston_housing.csv")

In [25]:
list_of_dataframe[1].describe()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,PRICE
count,10.000000,10.000000,10.000000,10.0,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,0.569789,3.750000,8.059000,0.0,0.533800,5.926200,63.610000,4.804180,4.300000,308.200000,19.260000,380.600000,12.064000,19.310000
std,0.319835,6.038074,0.130422,0.0,0.006763,0.239033,22.799876,0.910659,0.483046,1.932184,2.801666,32.615287,4.127609,2.282518
min,0.093780,0.000000,7.870000,0.0,0.524000,5.456000,29.300000,3.796500,4.000000,307.000000,15.200000,288.990000,6.580000,15.000000
25%,0.325515,0.000000,7.937500,0.0,0.527500,5.847750,43.375000,4.308900,4.000000,307.000000,16.650000,386.775000,8.917500,18.200000
50%,0.633860,0.000000,8.140000,0.0,0.538000,5.942000,65.650000,4.498600,4.000000,307.000000,21.000000,390.725000,11.485000,19.400000
75%,0.769600,9.375000,8.140000,0.0,0.538000,6.004250,82.600000,5.265050,4.750000,310.000000,21.000000,394.845000,14.320000,20.350000
max,1.053930,12.500000,8.140000,0.0,0.538000,6.377000,94.300000,6.346700,5.000000,311.000000,21.000000,396.900000,20.450000,23.100000

EXERCISE 10: Read CSV from inside a compressed (.zip/.gz/.bz2/.xz) file

In [26]:
df10 = pd.read_csv('csv_ex_1.zip')

In [27]:
df10

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

EXERCISE 11: Reading from an Excel file - how to use `sheet_name`

In [28]:
df11_1 = pd.read_excel("Housing_data.xlsx", sheet_name="Data_Tab_1")
df11_2 = pd.read_excel("Housing_data.xlsx", sheet_name="Data_Tab_2")
df11_3 = pd.read_excel("Housing_data.xlsx", sheet_name="Data_Tab_3")

In [29]:
df11_1.shape

(9, 14)

EXERCISE 13: General delimited text file can be read same as CSV

In [30]:
df13 = pd.read_table("Table_EX_1.txt", delimiter=',')
df13

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

EXERCISE 14: Read HTML tables directly from an URL

In [31]:
url = 'https://en.wikipedia.org/wiki/2016_Summer_Olympics_medal_table'
list_of_df = pd.read_html(url)

In [32]:
list_of_df[1]

                Rank                         NOC  Gold  Silver  Bronze  Total
0                  1         United States (USA)    46      37      38    121
1                  2         Great Britain (GBR)    27      23      17     67
2                  3                 China (CHN)    26      18      26     70
3                  4                Russia (RUS)    19      17      20     56
4                  5               Germany (GER)    17      10      15     42
..               ...                         ...   ...     ...     ...    ...
82                78               Nigeria (NGR)     0       0       1      1
83                78              Portugal (POR)     0       0       1      1
84                78   Trinidad and Tobago (TTO)     0       0       1      1
85                78  United Arab Emirates (UAE)     0       0       1      1
86  Totals (86 NOCs)            Totals (86 NOCs)   307     307     359    973

[87 rows x 6 columns]

In [33]:
for t in list_of_df:
    print(t.shape)

(4, 1)
(87, 6)
(10, 9)
(4, 2)
(1, 2)
(1, 2)

In [34]:
df15 = list_of_df[1]
df15.head()

  Rank                  NOC  Gold  Silver  Bronze  Total
0    1  United States (USA)    46      37      38    121
1    2  Great Britain (GBR)    27      23      17     67
2    3          China (CHN)    26      18      26     70
3    4         Russia (RUS)    19      17      20     56
4    5        Germany (GER)    17      10      15     42

EXERCISE 16: Read in a JSON file

In [35]:
df16 = pd.read_json('movies.json')

In [36]:
for cast in df16[df16['title']=='Bumblebee']['cast']:
    print (cast)

['Hailee Steinfeld', 'John Cena', 'Jorge Lendeborg Jr.', 'Jason Drucker', 'Rachel Crow', 'Pamela Adlon']

In [37]:
cast_of_avengers = df16[(df16['title']=="The Avengers") & (df16['year']==2012)]['cast']

In [38]:
print(list(cast_of_avengers))

[['Robert Downey, Jr.', 'Chris Evans', 'Mark Ruffalo', 'Chris Hemsworth', 'Scarlett Johansson', 'Jeremy Renner', 'Tom Hiddleston', 'Clark Gregg', 'Cobie Smulders', 'Stellan Skarsgård', 'Samuel L. Jackson']]

EXERCISE 17: Read Stata file (.dta)

In [39]:
df17 = pd.read_stata("wu-data.dta")
df17.head()

,id,year,province,totalpop,totalso2,reg_GDP,time,treatment,provincearea,group,SO2PC,SO2PGDP,GDPPC,GDPPC2,pop_density
0,Beijing,1991,Beijing,1094.0,210000,598.900024,1.0,0,16800,1,191.956131,191.956131,0.547441,0.299691,0.065119
1,Beijing,1992,Beijing,1102.0,200000,709.099976,2.0,0,16800,1,181.488205,181.488205,0.643466,0.414049,0.065595
2,Beijing,1993,Beijing,1112.0,203736,863.530029,3.0,0,16800,1,183.215820,183.215820,0.776556,0.603039,0.066190
3,Beijing,1994,Beijing,1125.0,175616,1084.030029,4.0,0,16800,1,156.103104,156.103104,0.963582,0.928491,0.066964
4,Beijing,1995,Beijing,1251.0,214899,1394.890015,5.0,0,16800,1,171.781769,171.781769,1.115020,1.243270,0.074464

EXERCISE 18: Read tabular data from PDF file

In [7]:
from tabula import read_pdf

ImportError: cannot import name 'read_pdf' from 'tabula' (C:\Users\yanick\AppData\Roaming\Python\Python39\site-packages\tabula\__init__.py)